namespace Besm6.Core
{

    /// <summary>
    /// Опкоды инструкций БЭСМ-6 (восьмеричные номера).
    /// </summary>
    public enum Opcode : ushort
    {
        // 000–037 (короткий формат, арифметика + логика)
        Zp   = 0x00, // 000 зп / atx
        Zpm  = 0x01, // 001 зпм / stx
        Reg  = 0x02, // 002 рег / mod (нелегально)
        Schm = 0x03, // 003 счм / xts
        Sl   = 0x04, // 004 сл / a+x
        Vch  = 0x05, // 005 вч / a-x
        Vchob= 0x06, // 006 вчоб / x-a
        Vchab= 0x07, // 007 вчаб / amx
        Sch  = 0x08, // 010 сч / xta
        I    = 0x09, // 011 и / aax
        Ntzh = 0x0A, // 012 нтж / aex
        Slc  = 0x0B, // 013 слц / arx
        Znak = 0x0C, // 014 знак / avx
        Ili  = 0x0D, // 015 или / aox
        Del  = 0x0E, // 016 дел / a/x
        Umn  = 0x0F, // 017 умн / a*x
        Sbr  = 0x10, // 020 сбр / apx
        Rzb  = 0x11, // 021 рзб / aux
        Ched = 0x12, // 022 чед / acx
        Ned  = 0x13, // 023 нед / anx
        Slep = 0x14, // 024 слп / e+x
        Vchp = 0x15, // 025 вчп / e-x
        Sd   = 0x16, // 026 сд / asx
        Rzh  = 0x17, // 027 рж / xtr
        Schrzh=0x18, // 030 счрж / rte
        Schmr=0x19, // 031 счмр / yta
        Zpp  = 0x1A, // 032 зпп (нелегально)
        Schp = 0x1B, // 033 счп (нелегально)
        Slpa = 0x1C, // 034 слпа / e+n
        Vchpa=0x1D, // 035 вчпа / e-n
        Sda  = 0x1E, // 036 сда / asn
        Rza  = 0x1F, // 037 ржа / ntr

        // 040–047 (индекс-регистры)
        Ui   = 0x20, // 040 уи / ati
        Uim  = 0x21, // 041 уим / sti
        Schi = 0x22, // 042 счи / ita
        Schim= 0x23, // 043 счим / its
        Uii  = 0x24, // 044 уии / mtj
        Sli  = 0x25, // 045 сли / j+m
        Sop  = 0x26, // 046 соп (нелегально)
        Op47 = 0x27, // 047 (нелегально)

        // 0220–0230 (модификатор, длинный формат)
        Moda = 0x90, // 0220 мода / utc
        Mod  = 0x98, // 0230 мод / wtc

        // 0240–0250 (индекс, длинный формат)
        Uia  = 0xA0, // 0240 уиа / vtm
        Slia = 0xA8, // 0250 слиа / utm

        // 0260–0270 (условные переходы)
        Po   = 0xB0, // 0260 по / uza
        Pe   = 0xB8, // 0270 пе / u1a

        // 0300–0310 (неусловные переходы)
        Pb   = 0xC0, // 0300 пб / uj
        Pv   = 0xC8, // 0310 пв / vjm

        // 0320–0330 (служебные)
        Vypr = 0xD0, // 0320 выпр / iret (нелегально)
        Stop = 0xD8, // 0330 стоп / stop

        // 0340–0350 (условные по M[reg])
        Pio  = 0xE0, // 0340 пио / vzm
        Pino = 0xE8, // 0350 пино / v1m

        // 0360–0370 (цикл)
        E36  = 0xF0, // 0360 э36 — как ПИО
        Tsikl= 0xF8, // 0370 цикл / vlm
    }
}
